[
  {
    "id": "azotto-dev",
    "title": "AzotoDev Portfolio",
    "description": "Portafolio personal y blog técnico desarrollado con Angular y Tailwind CSS.",
    "longDescription": "Portfolio personal diseñado para exhibir proyectos profesionales y compartir conocimientos técnicos a través de un blog integrado. Desarrollado utilizando Angular 19 con arquitectura basada en componentes standalone para mejorar la eficiencia y mantenibilidad. Implementa un sistema de temas claro/oscuro personalizable que respeta las preferencias del usuario. La interfaz está completamente optimizada para dispositivos móviles y tablets gracias a un diseño responsive construido con Tailwind CSS. El proyecto incluye optimizaciones de SEO para mejorar su visibilidad en motores de búsqueda y está desplegado en Firebase Hosting para garantizar un rendimiento óptimo y alta disponibilidad.",
    "imageUrl": "/assets/images/projects/azottodev.webp",
    "technologies": ["Angular", "TypeScript", "Tailwind CSS", "Firebase"],
    "demoUrl": "https://azotodev.web.app",
    "repoUrl": "https://github.com/azotto/portfolio",
    "featured": true,
    "date": "2025-03-15",
    "category": "Web"
  },
  {
    "id": "control-inventario",
    "title": "Control de Inventario",
    "description": "Aplicación de gestión de inventario con autenticación de usuarios y roles, reportes y estadísticas.",
    "longDescription": "Sistema integral para la gestión eficiente de inventarios empresariales, diseñado para optimizar la administración de productos, existencias y movimientos de almacén. La aplicación implementa un robusto sistema de autenticación con múltiples niveles de acceso y roles personalizables para garantizar la seguridad de los datos. Cuenta con un módulo avanzado de reportes que permite visualizar estadísticas clave como rotación de inventario, productos de baja demanda y proyecciones de stock. Incluye funcionalidades de alertas automáticas para niveles críticos de inventario, seguimiento en tiempo real de movimientos y generación de documentos PDF para pedidos y transferencias. La interfaz intuitiva facilita la gestión completa del ciclo de vida de los productos, desde su adquisición hasta su salida.",
    "imageUrl": "/assets/images/projects/weather-app.webp",
    "technologies": ["Angular", "Node.js", "Express", "MongoDB", "Windows Server"],
    "featured": false,
    "date": "2025-02-10",
    "category": "Web"
  },
  {
    "id": "gestion-documental",
    "title": "Gestion Documental",
    "description": "Aplicación de gestión de recepcion y turnado de documentos en tiempo real, con autenticación de usuarios y roles, reportes y estadisticas.",
    "longDescription": "Plataforma especializada para la digitalización y administración eficiente del flujo documental en organizaciones. El sistema automatiza la recepción, clasificación y distribución de documentos en tiempo real, reduciendo significativamente los tiempos de procesamiento y eliminando errores manuales. Incorpora un sofisticado sistema de autenticación multinivel con roles configurables que garantiza el acceso seguro y apropiado a la información según el perfil del usuario. La funcionalidad de turnado inteligente distribuye automáticamente los documentos a los departamentos o personas correspondientes según reglas predefinidas, con notificaciones instantáneas y seguimiento de estado. El módulo de reportería avanzada ofrece métricas detalladas sobre tiempos de respuesta, volúmenes de documentos procesados y análisis de rendimiento por departamento o usuario. Desplegado en Windows Server con alta disponibilidad, el sistema está diseñado para integrarse con las infraestructuras corporativas existentes y escalar según las necesidades organizacionales.",
    "imageUrl": "/assets/images/projects/gestion-documental.webp",
    "technologies": ["Angular", "Node.js", "Express", "MongoDB", "Windows Server"],
    "featured": true,
    "date": "2025-01-20",
    "category": "Fullstack"
  }
]
